# Pandas 연습
- Series, DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
dic = {'city':['서울','부산','대전','광주','대구'],
      'year':[2017,2016,2018,2019,2019],
      'temp':[19,20,18,21,18]}
dic

{'city': ['서울', '부산', '대전', '광주', '대구'],
 'year': [2017, 2016, 2018, 2019, 2019],
 'temp': [19, 20, 18, 21, 18]}

In [4]:
df = pd.DataFrame(dic)

In [5]:
df

  city  year  temp
0   서울  2017    19
1   부산  2016    20
2   대전  2018    18
3   광주  2019    21
4   대구  2019    18

In [8]:
df[['city','temp']] # column access

  city  temp
0   서울    19
1   부산    20
2   대전    18
3   광주    21
4   대구    18

In [9]:
df.index = ['a','b','c','d','e'] ; df

  city  year  temp
a   서울  2017    19
b   부산  2016    20
c   대전  2018    18
d   광주  2019    21
e   대구  2019    18

In [11]:
df.columns

Index(['city', 'year', 'temp'], dtype='object')

In [12]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [13]:
df.values # array로 나옴

array([['서울', 2017, 19],
       ['부산', 2016, 20],
       ['대전', 2018, 18],
       ['광주', 2019, 21],
       ['대구', 2019, 18]], dtype=object)

In [14]:
df.set_index(['city'])

      year  temp
city
서울    2017    19
부산    2016    20
대전    2018    18
광주    2019    21
대구    2019    18

In [15]:
df

  city  year  temp
a   서울  2017    19
b   부산  2016    20
c   대전  2018    18
d   광주  2019    21
e   대구  2019    18

In [18]:
### 특정 컬럼을 access 
df[['temp','year']]

   temp  year
a    19  2017
b    20  2016
c    18  2018
d    21  2019
e    18  2019

In [19]:
df.year

a    2017
b    2016
c    2018
d    2019
e    2019
Name: year, dtype: int64

### row access

In [20]:
df

  city  year  temp
a   서울  2017    19
b   부산  2016    20
c   대전  2018    18
d   광주  2019    21
e   대구  2019    18

In [21]:
df.loc[['c','d']]

  city  year  temp
c   대전  2018    18
d   광주  2019    21

In [22]:
df = df.set_index('city')

In [23]:
df

      year  temp
city
서울    2017    19
부산    2016    20
대전    2018    18
광주    2019    21
대구    2019    18

In [24]:
df.loc[['대전','부산']]

      year  temp
city
대전    2018    18
부산    2016    20

In [26]:
df.loc['부산':'광주'] # 부산부터 광주까지 (광주앞까지가 아님)

      year  temp
city
부산    2016    20
대전    2018    18
광주    2019    21

In [27]:
df.loc['대전':'광주']['temp']

city
대전    18
광주    21
Name: temp, dtype: int64

In [28]:
df

      year  temp
city
서울    2017    19
부산    2016    20
대전    2018    18
광주    2019    21
대구    2019    18

In [29]:
df['year']

city
서울    2017
부산    2016
대전    2018
광주    2019
대구    2019
Name: year, dtype: int64

In [30]:
df.iloc[1] # i는 indexnumber

year    2016
temp      20
Name: 부산, dtype: int64

In [31]:
df.iloc[2:4] # 2부터 4까지 해야함

      year  temp
city
대전    2018    18
광주    2019    21

- 이름으로 할때는 포함
- 숫자로 할때는 범위에서 제외

In [35]:
df['car'] = [50,30,20,10,30];df

      year  temp  car
city
서울    2017    19   50
부산    2016    20   30
대전    2018    18   20
광주    2019    21   10
대구    2019    18   30

In [37]:
df['high'] = df.car;df

      year  temp  car  high
city
서울    2017    19   50    50
부산    2016    20   30    30
대전    2018    18   20    20
광주    2019    21   10    10
대구    2019    18   30    30

In [38]:
df['high2'] = (df.car >= 30);df

      year  temp  car  high  high2
city
서울    2017    19   50    50   True
부산    2016    20   30    30   True
대전    2018    18   20    20  False
광주    2019    21   10    10  False
대구    2019    18   30    30   True

In [40]:
df.drop('high',axis = 1) 
# index를 drop함 따라서  axis = 1이라고 선언해 줘야함
# 원래 df에서 high는 사라지지않았음

      year  temp  car  high2
city
서울    2017    19   50   True
부산    2016    20   30   True
대전    2018    18   20  False
광주    2019    21   10  False
대구    2019    18   30   True

In [41]:
df.drop('대구') # 기본 default가 axis = 0

      year  temp  car  high  high2
city
서울    2017    19   50    50   True
부산    2016    20   30    30   True
대전    2018    18   20    20  False
광주    2019    21   10    10  False

In [42]:
df.drop('대구',axis = 0)

      year  temp  car  high  high2
city
서울    2017    19   50    50   True
부산    2016    20   30    30   True
대전    2018    18   20    20  False
광주    2019    21   10    10  False

# 람다 함수
- 이름없는 함수 (이름을 줄 수도 있음)
- 대부분 일회성 함수에 사용

In [43]:
f = lambda x: x.max() - x.min()

In [46]:
df = pd.DataFrame(np.arange(12).reshape(4,3),columns=['A','B','C'],
                 index = ['a','b','c','d'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [47]:
df.apply(f)

A    9
B    9
C    9
dtype: int64

In [48]:
df.apply(lambda x: x.max()-x.min()) # 일회성, 이름없는 함수

A    9
B    9
C    9
dtype: int64